In [20]:
#pandas
import pandas as pd
import numpy as np

In [13]:
np.arange(0,20).reshape(5,4)

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19]])

In [14]:
df=pd.DataFrame(np.arange(0,20).reshape(5,4),index=["row1","row2","row3","row4","row5"],columns=["col1",
                                                                                                 "col2","col3",
                                                                                                 "col4"])

In [15]:
df

      col1  col2  col3  col4
row1     0     1     2     3
row2     4     5     6     7
row3     8     9    10    11
row4    12    13    14    15
row5    16    17    18    19

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, row1 to row5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    5 non-null      int32
 1   col2    5 non-null      int32
 2   col3    5 non-null      int32
 3   col4    5 non-null      int32
dtypes: int32(4)
memory usage: 120.0+ bytes

In [19]:
df.describe()

            col1       col2       col3       col4
count   5.000000   5.000000   5.000000   5.000000
mean    8.000000   9.000000  10.000000  11.000000
std     6.324555   6.324555   6.324555   6.324555
min     0.000000   1.000000   2.000000   3.000000
25%     4.000000   5.000000   6.000000   7.000000
50%     8.000000   9.000000  10.000000  11.000000
75%    12.000000  13.000000  14.000000  15.000000
max    16.000000  17.000000  18.000000  19.000000

In [16]:
df[["col1","col2","col3"]]

      col1  col2  col3
row1     0     1     2
row2     4     5     6
row3     8     9    10
row4    12    13    14
row5    16    17    18

In [17]:
df["col1"]

row1     0
row2     4
row3     8
row4    12
row5    16
Name: col1, dtype: int32

In [26]:
df.loc[["row3","row4"]]

      col1  col2  col3  col4
row3     8     9    10    11
row4    12    13    14    15

In [27]:
df

      col1  col2  col3  col4
row1     0     1     2     3
row2     4     5     6     7
row3     8     9    10    11
row4    12    13    14    15
row5    16    17    18    19

In [18]:
df.iloc[2:4,0:2]

      col1  col2
row3     8     9
row4    12    13

In [29]:
df.iloc[3:4,2:3]

      col3
row4    14

In [30]:
df.iloc[2:,1:]

      col2  col3  col4
row3     9    10    11
row4    13    14    15
row5    17    18    19

In [31]:
df

      col1  col2  col3  col4
row1     0     1     2     3
row2     4     5     6     7
row3     8     9    10    11
row4    12    13    14    15
row5    16    17    18    19

In [35]:
df.iloc[0:5,3:]

      col4
row1     3
row2     7
row3    11
row4    15
row5    19

In [19]:
df.isnull().sum()

col1    0
col2    0
col3    0
col4    0
dtype: int64

In [38]:
df=pd.read_csv("BloodPressureTracker1.csv")
df

    patients  age  Systolic  Diastolic  Heart Rate  glucose  outcomes
0          1   20       129         79          72        6         1
1          2   24       133         80          75        2         0
2          3   42       142         86          70        4         0
3          4   44       141         84          68        5         1
4          5   35       137         84          70        6         0
5          6   27       139         83          72        8         1
6          7   29       140         85          78        9         1
7          8   34       138         85          69        1         1
8          9   39       135         79          75        2         1
9         10   36       136         81          72        8         1
10        11   26       137         83          69        4         0
11        12   23       138         85          66        3         0
12        13   30       135         80          67        7         1
13        14   33       142         85          72        4         0

In [40]:
type(df)

pandas.core.frame.DataFrame

In [33]:
data=('col1,col2,col3\n'
     'x,y,1\n'
     'a,b,3\n'
     'c,d,3')

In [2]:
data

'col1,col2,col3\nx,y,1\na,b,3\nc,d,3'

In [35]:
df=pd.read_csv(StringIO(data))
df

  col1 col2  col3
0    x    y     1
1    a    b     3
2    c    d     3

In [23]:
from io import StringIO

In [4]:
type(data)

str

In [9]:
#in memory file format object
StringIO(data)

In [20]:
pd.read_csv(StringIO(data))

  col1 col2  col3
0    x    y     1
1    a    b     3
2    c    d     3

In [25]:
pd.read_csv(StringIO(data),usecols=["col2","col1"])

  col1 col2
0    x    y
1    a    b
2    c    d

In [28]:
df.to_csv("hello.csv",index=False)

In [21]:
#datatype in csv
data1=('a,b,c,d\n'
     '1,2,3,4\n'
     '5,6,7,8\n'
     '9,10,11')

In [24]:
pd.read_csv(StringIO(data1))

   a   b   c    d
0  1   2   3  4.0
1  5   6   7  8.0
2  9  10  11  NaN

In [36]:
data1

'a,b,c,d\n1,2,3,4\n5,6,7,8\n9,10,11'

In [37]:
type(data1)

str

In [38]:
StringIO(data1)

In [45]:
df=pd.read_csv(StringIO(data1))

In [46]:
df.info(data1)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int64
 1   b       3 non-null      int64
 2   c       3 non-null      int64
 3   d       2 non-null      float64
dtypes: float64(1), int64(3)
memory usage: 224.0 bytes

In [43]:
df=pd.read_csv(StringIO(data1),dtype="object")

In [44]:
df.info(data1)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      object
 1   b       3 non-null      object
 2   c       3 non-null      object
 3   d       2 non-null      object
dtypes: object(4)
memory usage: 224.0+ bytes

In [47]:
df.isnull().sum()

a    0
b    0
c    0
d    1
dtype: int64

In [49]:
df['a'][0]

1

In [56]:
df=pd.read_csv(StringIO(data1),dtype={"a":int,'b':float,'c':int})
df

   a     b   c    d
0  1   2.0   3  4.0
1  5   6.0   7  8.0
2  9  10.0  11  NaN

In [57]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int32
 1   b       3 non-null      float64
 2   c       3 non-null      int32
 3   d       2 non-null      float64
dtypes: float64(2), int32(2)
memory usage: 200.0 bytes

In [58]:
df.dtypes

a      int32
b    float64
c      int32
d    float64
dtype: object

In [30]:
data2=('Index,a,b,c\n'
     '1,virat,india,4\n'
     '5,smith,australia,8\n'
     '9,roy,england,11')

In [27]:
data2

'Index,a,b,c1,virat,india,4\n5,smith,australia,8\n9,roy,england,11'

In [31]:
df=pd.read_csv(StringIO(data2))
df

   Index      a          b   c
0      1  virat      india   4
1      5  smith  australia   8
2      9    roy    england  11

In [ ]:
#python pandas working with json
In part we are going to learn about
1 read Json(read_json)
2 To Json(to_json)
3 Json Normalize

In [1]:
data=("virat,rahul,rohit,gill,shami")
data

'virat,rahul,rohit,gill,shami'

In [2]:
type(data)

str

In [3]:
import pandas as pd